Tutorials/featureCases/2D_flowOverHeatedPlate/constant/solid/thermoMechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// The thermomechanics dictionary has the same structure as the solverDict of OFFBEAT
// Differences and/or new additions are explained and commented

//- Thermal and Mechanical solver selection: other OFFBEAT cards not needed

thermalSolver           solidConduction;
mechanicsSolver         fromLatestTime;

//- Same as OFFBEAT 

materialProperties      byZone;
rheology                byMaterial;

heatSource              fromLatestTime;
sliceMapper             autoAxialSlices;

globalOptions
{
    pinDirection            (0 0 1);
    reactorType             "LWR";
    angularFraction 1;
    linkedFuel false;
}

couplingOptions
{
    correctTFromTH off;
    correctDispForNeutro off;
}

materials
{

    solid
    {
        //for structures
        material        constant;
        rho             rho     [1 -3 0 0 0]        1; //density
        E               E       [1 -1 -2 0 0]       2e+11;  // Young modulus
        nu              nu      [0 0 0 0 0]         0.3; // Poisson ratio
        Cp              Cp      [0 2 -2 -1 0]       100; // cp
        k               k       [1 1 3 -1 0]        100; // conductivity
        alpha           alpha   [0 0 0 0 0]         1e-5; // linear expansion coeff (1/K)
        Tref            Tref    [0 0 0 0 0]         0;
        emissivity      emissivity [0 0 0 0 0]      0.0; // emissivity

        rheologyModel elasticity;
    }

};


// ************************************************************************* //
