Tutorials/featureCases/2D_flowOverHeatedPlate/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;

}

divSchemes
{
    default none;

    div(alphaRhoPhi,U) Gauss vanLeer;
    div(alphaRhoPhi,he) Gauss vanLeer;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div(alphaRhoPhiNu,U) Gauss linear; 
    div(alphaRhoPhi,K) Gauss linear; 
}

laplacianSchemes
{
    default none;
    laplacian(((alpha*)*nuEff),U) Gauss linear corrected;
    laplacian(rAUf,p_rgh) Gauss linear corrected;
    laplacian((1|A(U)),p_rgh) Gauss linear corrected;
    laplacian(diffusivity,cellMotionU) Gauss linear corrected;

    laplacian((interpolate(alpha)*interpolate(alphaEff)),h) Gauss linear corrected;
}


snGradSchemes
{
    default         corrected;
}
fluxRequired
{
    default         no;
    p_rgh;
}

interpolationSchemes
{
    default         linear;
}


// ************************************************************************* //
